
&НаКлиенте
Процедура ПолучитьAccessToken(Команда)
	
	ОповещениеПослеВвода = Новый ОписаниеОповещения("ООПолучитьAccessToken", ЭтотОбъект);
	ПоказатьВводСтроки(ОповещениеПослеВвода, , "Введите код авторизации для получения нового Токена", 36, Ложь); 
	
КонецПроцедуры

&НаКлиенте
Процедура ООПолучитьAccessToken(authorizationCode, ДополнительныеПараметры) Экспорт

	QWEP_Клиент.ПолучитьAccessToken(authorizationCode, ДополнительныеПараметры);
	Элементы.Список.Обновить();

КонецПроцедуры
