
&НаКлиенте
Процедура ПолучитьИсториюЗаказов(Команда)
	
	Если Аккаунт.Пустая() Тогда
		Сообщить("Не выбран аккаунт!");
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("id", ПолучитьКодАккаунтаПоСсылке(Аккаунт));
	СтруктураПараметров.Вставить("limit", КоличествоЗаписей);
	
	Статус = Ложь;
	
	QWEP_Клиент.ПолучитьИсториюЗаказов(СтруктураПараметров, Статус);
	
	Если Статус Тогда
		Элементы.Список.Обновить();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКодАккаунтаПоСсылке(СсылкаНаАккаунт)

	Возврат Число(СсылкаНаАккаунт.ПолныйКод());

КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КоличествоЗаписей = 100;
	
КонецПроцедуры
