&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)    
    
    Если Параметры.Свойство("МассивКороткихАртикулов") Тогда        	
        Для каждого Строка Из Параметры.МассивКороткихАртикулов Цикл            
            НоваяСтрока = Совпадения.Добавить();
            ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
            НоваяСтрока.Выбор = "Выбрать";
        КонецЦикла;
        СтандартнаяСтрока = Совпадения.Добавить();
        СтандартнаяСтрока.partname = "Стандартный поиск (как на сайте поставщика)";
        СтандартнаяСтрока.Выбор = "Выбрать";
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура СовпаденияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    
    СтруктураЗакрытия = Новый Структура;
    СтруктураЗакрытия.Вставить("ИдентификаторКороткогоАртикула", Элемент.ТекущиеДанные.id);
    СтруктураЗакрытия.Вставить("Бренд", Элемент.ТекущиеДанные.brand);
	Закрыть(СтруктураЗакрытия);
    
КонецПроцедуры
